{
  "symptoms": {
    "Tomato_Late_blight": {
      "disease": "Tomato Late Blight",
      "translations": {
        "hi": "टमाटर का लेट ब्लाइट",
        "bn": "টমেটো লেট ব্লাইট"
      },
      "treatments": {
        "en": "Spray fungicide containing chlorothalonil or mancozeb. Remove infected leaves.",
        "hi": "क्लोरोथालोनिल या मैंकोजेब युक्त फफूंदनाशी का छिड़काव करें। संक्रमित पत्तियों को हटा दें।"
      }
    },
    "Pepper__bell__Bacterial_spot": {
      "disease": "Pepper Bell Bacterial Spot",
      "translations": {
        "hi": "शिमला मिर्च का जीवाणु धब्बा रोग",
        "bn": "ক্যাপসিকামের ব্যাকটেরিয়াল দাগ"
      },
      "treatments": {
        "en": "Apply copper-based bactericides and remove infected plant debris.",
        "hi": "कॉपर आधारित जीवाणुनाशी का उपयोग करें और संक्रमित पौधों को हटा दें।"
      }
    },
    "Pepper__bell___healthy": {
      "disease": "Healthy Pepper Bell",
      "translations": {
        "hi": "स्वस्थ शिमला मिर्च",
        "bn": "সুস্থ ক্যাপসিকাম"
      },
      "treatments": {
        "en": "No treatment required. Maintain proper watering and sunlight.",
        "hi": "कोई उपचार आवश्यक नहीं। उचित सिंचाई और धूप बनाए रखें।"
      }
    },
    "Potato___healthy": {
      "disease": "Healthy Potato",
      "translations": {
        "hi": "स्वस्थ आलू",
        "bn": "সুস্থ আলু"
      },
      "treatments": {
        "en": "No treatment required. Maintain crop rotation and soil health.",
        "hi": "कोई उपचार आवश्यक नहीं। फसल चक्र और मिट्टी की सेहत बनाए रखें।"
      }
    },
    "Potato___Late_blight": {
      "disease": "Potato Late Blight",
      "translations": {
        "hi": "आलू का लेट ब्लाइट",
        "bn": "আলুর লেট ব্লাইট"
      },
      "treatments": {
        "en": "Spray fungicide containing metalaxyl or chlorothalonil. Avoid waterlogging.",
        "hi": "मेटालेक्सिल या क्लोरोथालोनिल युक्त फफूंदनाशी का छिड़काव करें। जलभराव से बचें।"
      }
    },
    "Tomato__Target_Spot": {
      "disease": "Tomato Target Spot",
      "translations": {
        "hi": "टमाटर का टारगेट स्पॉट रोग",
        "bn": "টমেটোর টার্গেট দাগ রোগ"
      },
      "treatments": {
        "en": "Apply fungicides containing azoxystrobin or chlorothalonil. Remove affected leaves.",
        "hi": "एजोक्सीस्ट्रोबिन या क्लोरोथालोनिल वाले फफूंदनाशी का छिड़काव करें। प्रभावित पत्तियों को हटा दें।"
      }
    },
    "Tomato__Tomato_mosaic_virus": {
      "disease": "Tomato Mosaic Virus",
      "translations": {
        "hi": "टमाटर मोज़ेक वायरस",
        "bn": "টমেটো মোজাইক ভাইরাস"
      },
      "treatments": {
        "en": "Remove infected plants. Avoid tobacco use before handling tomato plants.",
        "hi": "संक्रमित पौधों को हटा दें। पौधों को छूने से पहले तंबाकू के उपयोग से बचें।"
      }
    },
    "Tomato__Tomato_YellowLeaf__Curl_Virus": {
      "disease": "Tomato Yellow Leaf Curl Virus",
      "translations": {
        "hi": "टमाटर येलो लीफ कर्ल वायरस",
        "bn": "টমেটো ইয়েলো লিফ কার্ল ভাইরাস"
      },
      "treatments": {
        "en": "Control whiteflies using insecticides and remove infected plants.",
        "hi": "सफेद मक्खियों को कीटनाशक से नियंत्रित करें और संक्रमित पौधों को हटा दें।"
      }
    },
    "Tomato_Bacterial_spot": {
      "disease": "Tomato Bacterial Spot",
      "translations": {
        "hi": "टमाटर का जीवाणु धब्बा रोग",
        "bn": "টমেটোর ব্যাকটেরিয়াল দাগ"
      },
      "treatments": {
        "en": "Use copper-based bactericides and avoid overhead irrigation.",
        "hi": "कॉपर आधारित जीवाणुनाशी का उपयोग करें और ऊपरी सिंचाई से बचें।"
      }
    },
    "Tomato_Early_blight": {
      "disease": "Tomato Early Blight",
      "translations": {
        "hi": "टमाटर का अर्ली ब्लाइट",
        "bn": "টমেটো আরলি ব্লাইট"
      },
      "treatments": {
        "en": "Spray fungicide like mancozeb or chlorothalonil. Remove affected foliage.",
        "hi": "मैंकोजेब या क्लोरोथालोनिल जैसे फफूंदनाशी का छिड़काव करें। संक्रमित पत्तियों को हटा दें।"
      }
    },
    "Tomato_healthy": {
      "disease": "Healthy Tomato",
      "translations": {
        "hi": "स्वस्थ टमाटर",
        "bn": "সুস্থ টমেটো"
      },
      "treatments": {
        "en": "No treatment required. Maintain good watering and sunlight.",
        "hi": "कोई उपचार आवश्यक नहीं। उचित पानी और धूप बनाए रखें।"
      }
    },
    "Tomato_Leaf_Mold": {
      "disease": "Tomato Leaf Mold",
      "translations": {
        "hi": "टमाटर का लीफ मोल्ड",
        "bn": "টমেটো লিফ মোল্ড"
      },
      "treatments": {
        "en": "Provide good ventilation and apply fungicide containing copper or chlorothalonil.",
        "hi": "अच्छा वेंटिलेशन बनाए रखें और कॉपर या क्लोरोथालोनिल युक्त फफूंदनाशी का प्रयोग करें।"
      }
    },
    "Tomato_Septoria_leaf_spot": {
      "disease": "Tomato Septoria Leaf Spot",
      "translations": {
        "hi": "टमाटर का सेप्टोरिया पत्ती धब्बा रोग",
        "bn": "টমেটো সেপটোরিয়া লিফ স্পট"
      },
      "treatments": {
        "en": "Remove infected leaves and spray fungicide containing mancozeb or chlorothalonil.",
        "hi": "संक्रमित पत्तियों को हटा दें और मैंकोजेब या क्लोरोथालोनिल युक्त फफूंदनाशी का छिड़काव करें।"
      }
    },
    "Tomato_Spider_mites_Two_spotted_spider_mite": {
      "disease": "Tomato Spider Mites (Two-Spotted)",
      "translations": {
        "hi": "टमाटर स्पाइडर माइट (दो धब्बों वाला)",
        "bn": "টমেটো স্পাইডার মাইট (দুই দাগযুক্ত)"
      },
      "treatments": {
        "en": "Spray neem oil or miticides. Maintain proper humidity and remove infested leaves.",
        "hi": "नीम तेल या माइटनाशी का छिड़काव करें। उचित नमी बनाए रखें और संक्रमित पत्तियों को हटा दें।"
      }
    },
    "Potato__Early_blight": {
      "disease": "Potato Early Blight",
      "translations": {
        "hi": "आलू का अर्ली ब्लाइट"
      },
      "treatments": {
        "en": "Use copper-based fungicides and rotate crops.",
        "hi": "तांबे वाले फफूंदनाशी का प्रयोग करें और फसल परिवर्तन करें।"
      }
    },
    "yellow leaves": {
      "disease": "Nitrogen Deficiency",
      "translations": {
        "hi": "पीले पत्ते",
        "bn": "হলুদ পাতা",
        "ta": "மஞ்சள் இலைகள்",
        "te": "పసుపు ఆకులు",
        "pa": "ਪੀਲੇ ਪੱਤੇ"
      },
      "treatments": {
        "en": "Apply nitrogen-rich fertilizer (e.g., urea) and add compost; improve watering schedule.",
        "hi": "नाइट्रोजन युक्त उर्वरक (जैसे यूरिया) डालें और खाद मिलाएँ; सिंचाई के समय में सुधार करें।",
        "bn": "নাইট্রোজেন-সমৃদ্ধ সার (যেমন ইউরিয়া) ব্যবহার করুন এবং কম্পোস্ট যোগ করুন; সেচের সময়সূচি উন্নত করুন।",
        "ta": "நைட்ரஜன் சமృద్ధ உரம் (உதாரணம்: யூரியா) பயன்படுத்தவும்; பாழாமரைச் சேர்க்கவும்; செடிகாலத்தை மெருகு செய்யவும்.",
        "te": "నైట్రోజన్ ఉండే ఎరువు (ఉదాహరణకు యూరియా) వినియోగించండి, కంపోస్ట్ జోడించండి; నీరు ఇవ్వడంలో సమయం మెరుగుపరుచుకోండి.",
        "pa": "ਨਾਈਟ੍ਰੋਗਨ ਵਾਲਾ ਖਾਦ (ਜਿਵੇਂ ਯੂਰੀਆ) ਲਗਾਓ ਅਤੇ ਖਾਦ ਸ਼ਾਮਿਲ ਕਰੋ; ਪਾਣੀ ਦੇ ਸਮੇਂ 'ਚ ਸੁਧਾਰ ਕਰੋ।"
      }
    },
    "white powder on leaves": {
      "disease": "Powdery Mildew",
      "translations": {
        "hi": "पतियों पर सफेद पाउडर",
        "bn": "পাতায় সাদা গুঁড়ো",
        "ta": "இலைகளில் வெள்ளை மானகம்",
        "te": "ఆకు పై తెల్ల పొడి",
        "pa": "ਪੱਤਿਆਂ 'ਤੇ ਸਫੈਦ ਚੂਨਾ"
      },
      "treatments": {
        "en": "Remove affected leaves, improve airflow, spray sulfur or neem-based fungicide.",
        "hi": "प्रभावित पत्तियां हटाएं, हवा का प्रवाह बढ़ाएँ, गंधक या नीम-आधारित फफूंदनाशक छिड़कें।",
        "bn": "সংক্রমিত পাতা সরান, বায়ু চলাচল বাড়ান, সালফার বা নিম-ভিত্তিক ফাঙ্গিসাইড ছিটান।",
        "ta": "தெரிந்த இலைகளை அகற்று, காற்று ஓட்டத்தை மேம்படுத்து, கும்பளி அல்லது நிம் பேஸ்ட் பூஞ்சைநாசினி தெளிக்கவும்.",
        "te": "సంక్రమిత ఆుకులు తీసేయండి, గాలి మార్పిడి మెరుగుపరుచండి, సల్ఫర్ లేదా నిమ్ ఫంగిసైడ్ స్ప్రే చేయండి.",
        "pa": "ਪ੍ਰਭਾਵਿਤ ਪੱਤਿਆਂ ਨੂੰ ਹਟਾਓ, ਹਵਾਈ ਗਤੀ ਸੁਧਾਰੋ, ਗੰਧਕ ਜਾਂ ਨੀਮ ਵਾਲਾ ਫੰਗિસਾਇਡ ਛਿੜਕੋ।"
      }
    },
    "brown spots on leaves": {
      "disease": "Leaf Spot / Blast",
      "translations": {
        "hi": "पतियों पर भूरे धब्बे",
        "bn": "পাতায় বাদামী দাগ",
        "ta": "இலைகளில் பழுப்பு சின்னங்கள்",
        "te": "ఆకు పై గోధుమ మచ్చలు",
        "pa": "ਪੱਤਿਆਂ 'ਤੇ ਭੂਰੇ ਦਾਗ"
      },
      "treatments": {
        "en": "Remove affected tissue, avoid overhead irrigation, apply recommended fungicide.",
        "hi": "प्रभावित भाग हटाएँ, ऊपर से जल न दें, अनुशंसित फफूंदनाशक लगाएँ।",
        "bn": "প্রভাবিত অংশ সরান, উপরিভাগীয় সেচ এড়ান, প্রস্তাবিত ফাঙ্গিসাইড ব্যবহার করুন।",
        "ta": "நோயோடு பாதிக்கப்பட்ட பகுதிகளை நீக்கவும், மேலிருந்து நீரை தவிர்க்கவும், பரிந்துரைக்கப்பட்ட பூஞ்சைநாசினி தெளிக்கவும்.",
        "te": "సంక్రమిత భాగాలను తొలగించండి, పై నుంచి నీరిపారదటిని చేయవద్దు, సూచించిన ఫంగిసైడ్ వాడండి.",
        "pa": "ਪ੍ਰਭਾਵਿਤ ਹਿੱਸੇ ਹਟਾਓ, ਉੱਪਰੋਂ ਪਾਣੀ ਨਾ ਦਿਓ, ਸੁਝਾਏ ਫੰਗਿਸਾਇਡ ਵਰਤੋ।"
      }
    },
    "wilting": {
      "disease": "Root Rot / Vascular Wilt",
      "translations": {
        "hi": "मुरझाना",
        "bn": "মলিন হওয়া",
        "ta": "வாடுதல்",
        "te": "వాడిపోవడం",
        "pa": "ਮੁਰਝਾਉਣਾ"
      },
      "treatments": {
        "en": "Check roots for rot, improve drainage, avoid overwatering; treat with recommended fungicide if fungal.",
        "hi": "जड़ों की जांच करें, जल निकासी सुधारें, अधिक पानी न दें; यदि फंगल है तो फफूंदनाशक लगाएँ।",
        "bn": "শিকড় পরীক্ষা করুন, নিষ্কাশন উন্নত করুন, অতিরিক্ত সেচ বন্ধ করুন; ফাঙ্গাল হলে ফাঙ্গিসাইড ব্যবহার করুন।",
        "ta": "வேர் பாகங்களை பரிசோதிக்கவும், வடிகிடல் மேம்படுத்தவும், அதிக நீர் அளிக்காதீர்கள்; பூஞ்சானால் பூஞ்சைநாசினி தெளிக்கவும்.",
        "te": "వేర్లను పరీక్షించండి, డ్రెయినేజ్ మెరుగుపరుచుకోండి, ఎక్కువ నీరు ఇవ్వొద్దు; ఫంగస్ ఉంటే ఫంగిసైడ్ వాడండి.",
        "pa": "ਰੂਟ ਦੀ ਜਾਂਚ ਕਰੋ, ਨਿਕਾਸ ਸੁਧਾਰੋ, ਜਿਆਦਾ ਪਾਣੀ ਨਾ ਦਿਓ; ਫੰਗਸ ਹੋਵੇ ਤਾਂ ਫੰਗਿਸਾਇਡ ਵਰਤੋ।"
      }
    },
    "stunted growth": {
      "disease": "Nutrient Deficiency / Zinc Deficiency",
      "translations": {
        "hi": "बुना विकास / धीमी वृद्धि",
        "bn": "বিকাশে ব্যর্থতা",
        "ta": "சற்றே வளர்ச்சி",
        "te": "వృద్ధి నిలిచిపోవడం",
        "pa": "ਛੋਟੀ ਵਾਧ"
      },
      "treatments": {
        "en": "Apply balanced NPK and zinc sulfate as per soil test; improve organic matter.",
        "hi": "मिट्टी की जाँच के अनुसार संतुलित NPK और जिंक सल्फेट लगाएँ; कार्बनिक पदार्थ बढ़ाएँ।",
        "bn": "মাটির পরীক্ষা অনুযায়ী ভারসাম্য NPK এবং জिंक সালফেট ব্যবহার করুন; জৈব পদার্থ বাড়ান।",
        "ta": "மண்ணு சோதனைபடி சமநிலை NPK மற்றும் சிங்க் சல்பேட் இடவும்; கார்பனிக் பொருள் வளர்க்கவும்.",
        "te": "మట్టి పరీక్ష ప్రకారం సమతూల NPK మరియు జింక్ సల్ఫేట్ ఉపయోగించండి; ఆర్గానిక్ పదార్థం పెంచండి.",
        "pa": "ਮਿੱਟੀ ਟੈਸਟ ਮੁਤਾਬਕ NPK ਅਤੇ ਜ਼ਿੰਕ ਸਲਫੇਟ ਲਗਾਓ; ਆਰਗੈਨਿਕ ਵਸਤੂ ਵਧਾਓ।"
      }
    },
    "rust colored pustules": {
      "disease": "Wheat Rust",
      "translations": {
        "hi": "सड़ा हुआ लाल-भूरे धब्बे",
        "bn": "জং রঙের দাগ",
        "ta": "பழுப்பு சருமப் புள்ளிகள்",
        "te": "రస్ట్ రంగు పెక్కులు",
        "pa": "ਜ਼ੰਗ ਜਿਹੇ ਫੁਟਕਣ"
      },
      "treatments": {
        "en": "Use rust-resistant varieties and timely fungicide sprays (consult extension services).",
        "hi": "रस्ट-प्रतिरोधी किस्में उगाएँ और समय पर फफूंदनाशक छिड़काव करें (किसी विशेषज्ञ से सलाह लें)।",
        "bn": "রস্ট-প্রতিরোধী জাত ব্যবহার করুন এবং সময়মত ফাঙ্গিসাইড ছিটান (পরামর্শ নিন)।",
        "ta": "ரஸ்ட் எதிர்ப்பு வகைகள் பயிரிடவும் மற்றும் காலக்கெடு போக்குட்டு பூஞ்சைநாசினி தெளிக்கவும்.",
        "te": "రస్ట్ రెసిస్టెంట్ వేరైటీలు ధరించండి, సమయానికి ఫంగిసైడ్ స్ప్రే చేయండి.",
        "pa": "ਰਸਟ-ਰੋਧੀ ਕਿਸਮਾਂ ਉਗਾਓ ਅਤੇ ਸਮੇਂ-ਸਮੇਂ ਤੇ ਫੰਗਿਸਾਇਡ ਛਿੜਕੋ।"
      }
    },
    "mottled mosaic on leaves": {
      "disease": "Mosaic Virus",
      "translations": {
        "hi": "पतियों पर मोजेक पैटर्न",
        "bn": "পাতায় মোজাইক পাতার নিদর্শন",
        "ta": "இலைகளில் மோசைக் மாதிரி",
        "te": "ఆకులపై మోజేక్ ముద్రలు",
        "pa": "ਪੱਤਿਆਂ 'ਤੇ ਮੋਜ਼ੈਕ ਨਮੂਨਾ"
      },
      "treatments": {
        "en": "Remove infected plants, control insect vectors (aphids/whiteflies) and use virus-free planting material.",
        "hi": "संक्रमित पौधों को हटाएँ, कीट वाहकों (एफ़िड/व्हाइटफ्लाई) को नियंत्रित करें और वायरस-रहित बीज/रोपण सामग्री उपयोग करें।",
        "bn": "সংক্রমিত উদ্ভিদ সরান, কীট বাহক নিয়ন্ত্রণ করুন এবং ভাইরাস-মুক্ত রোপণ ব্যবহার করুন।",
        "ta": "ஆழ்சேரியாக பாதிக்கப்பட்ட செடிகளை அகற்று, பூச்சி ஊடகங்களை கட்டுப்படுத்து மற்றும் வைரஸ் இல்லாத விதைகள் பயன்படுத்து.",
        "te": "సంక్రమిత మొక్కలను తొలగించండి, ఆపిడ్స్/వైట్‌ఫ్లై లను నియంత్రించండి, వైరస్-రహిత విత్తనాలు వాడండి.",
        "pa": "ਸੰਕ੍ਰਮਿਤ ਪੌਦਿਆਂ ਨੂੰ ਹਟਾਓ, ਕੀਟ ਵੇਕਟਰਾਂ ਨੂੰ ਨਿਯੰਤਰਿਤ ਕਰੋ ਅਤੇ ਵਾਇਰਸ-ਮੁਕਤ ਰੋਪਣ ਸਮੱਗਰੀ ਵਰਤੋ।"
      }
    },
    "leaf curl": {
      "disease": "Leaf Curl Virus (Tomato)",
      "translations": {
        "hi": "पत्ती का मुड़ना",
        "bn": "পাতা কুঁচকে যাওয়া",
        "ta": "இலை வளைவாகுதல்",
        "te": "ఆకు వుంచుకుపోవడం",
        "pa": "ਪੱਤਾ ਮੋੜ"
      },
      "treatments": {
        "en": "Use resistant varieties, control whiteflies, remove infected plants and practice crop rotation.",
        "hi": "प्रतिरोधी किस्में लगाएँ, व्हाइटफ्लाई नियंत्रित करें, संक्रमित पौधों को हटाएँ और फसल चक्रीकरण अपनाएँ।",
        "bn": "প্রতিরোধী জাত ব্যবহার করুন, হোয়াইটফ্লাই নিয়ন্ত্রণ করুন, আক্রান্ত গাছ সরান এবং ফসল পাল্টান।",
        "ta": "பாதிக்கப்பட்ட செடிகளை அகற்று, வெள்ளை பட்டை பூச்சியை கட்டுப்படுத்து, எதிர்ப்பு வகைகள் பயிரிடவும்.",
        "te": "రోగించగా ఉన్న మొక్కలను తీసేయండి, వైట్‌ఫ్లై నియంత్రించండి, రెసిస్టెంట్ వేరైటీలు వపరించండి.",
        "pa": "ਰੋਗੀ ਪੌਦਿਆਂ ਨੂੰ ਹਟਾਓ, ਵਾਈਟਫਲਾਈ ਨਿਯੰਤਰਿਤ ਕਰੋ, ਰੋਧੀ ਕਿਸਮਾਂ ਵਰਤੋ।"
      }
    },
    "fruit rot": {
      "disease": "Fruit Rot / Phytophthora",
      "translations": {
        "hi": "फल सड़न",
        "bn": "ফল পচা",
        "ta": "பழம் சிதைவாகுதல்",
        "te": "పండు చిక్కుముడి",
        "pa": "ਫਲ ਸੜਨ"
      },
      "treatments": {
        "en": "Improve drainage, avoid overhead irrigation, remove infected fruits and apply recommended fungicide.",
        "hi": "जल निकासी सुधारें, ऊपर से सिंचाई न करें, संक्रमित फल हटाएँ और फफूंदनाशक लगाएँ।",
        "bn": "নিষ্কাশন উন্নত করুন, উপরিভাগীয় সেচ এড়ান, আক্রান্ত ফল সরান এবং ফাঙ্গিসাইড প্রয়োগ করুন।",
        "ta": "வடிகாலை மேம்படுத்து, மேலிருந்து நீர் அளிக்காதீர்கள், பாதிக்கப்பட்ட பழங்களை அகற்று, பரிந்துரைக்கபட்ட பூஞ்சைநாசினி பயன் படுத்தவும்.",
        "te": "డ్రెయినేజ్ మెరుగుపరుచండి, పై నుంచి నీరు ఇవ్వకండి, సంక్రమిత పండ్లను తీసేయండి, సూచించిన ఫంగిసైడ్ వాడండి.",
        "pa": "ਨਿਕਾਸ ਸੁਧਾਰੋ, ਉੱਪਰੋਂ ਪਾਣੀ ਨਾ ਦਿਓ, ਸੰਕ੍ਰਮਿਤ ਫਲ ਹਟਾਓ, ਫੰਗਿਸਾਇਡ ਲਗਾਓ।"
      }
    },
    "black rot on cabbage": {
      "disease": "Black Rot (Brassicas)",
      "translations": {
        "hi": "काला सड़न (पत्तागोभी)",
        "bn": "কালো পচন (ব্রাসিকা)",
        "ta": "கருப்பு சிதைவு",
        "te": "కాలి పసుపు పాడు",
        "pa": "ਕਾਲਾ ਸੜਨ (ਹਰੀ ਸਬਜ਼ੀਆਂ)"
      },
      "treatments": {
        "en": "Use disease-free seeds, practice crop rotation and spray copper-based bactericide if needed.",
        "hi": "रोग-मुक्त बीज का उपयोग करें, फसल चक्रीकरण करें और आवश्यकता पर तांबे-आधारित बैक्टीरिसाइड छिड़कें।",
        "bn": "রোগমুক্ত বীজ ব্যবহার করুন, ফসল পাল্টান এবং প্রয়োজন হলে কপার-বেসড ব্যাকটেরিসাইড স্প্রে করুন।",
        "ta": "நோயின்றி விதைகள் உபயோகிக்கவும், பயிர் சுழற்சி பின்பற்றுங்கள், தேவையானால் தாமிர அடிப்படைக் கிருமிநாசினி தெளிக்கவும்.",
        "te": "రోగముక్త విత్తనాలు వాడండి, పంట రొటేషన్ చేయండి, అవసరమైతే కాపర్ బేస్డ్ బాక్టీరీసైడ్ వాడండి.",
        "pa": "ਰੋਗਮੁਕਤ ਬੀਜ ਵਰਗੇ, ਫਸਲ ਰੋਟੇਸ਼ਨ ਕਰੋ ਅਤੇ ਲੋੜ ਹੋਣ 'ਤੇ ਕਾਪਰ-ਅਧਾਰਿਤ ਬੈਕਟੀਰਿਸਾਇਡ ਛਿੜਕੋ।"
      }
    },
    "late blight symptoms": {
      "disease": "Late Blight (Potato/Tomato)",
      "translations": {
        "hi": "लेट ब्लाइट के लक्षण",
        "bn": "লেট ব্লাইট লক্ষণ",
        "ta": "லேட் பிளைட் அறிகுறிகள்",
        "te": "లేట్ బ్లైట్ లక్షణాలు",
        "pa": "ਲੇਟ ਬਲਾਈਟ ਲਕਸ਼ਣ"
      },
      "treatments": {
        "en": "Use fungicides like mancozeb & metalaxyl as recommended; remove infected plants and avoid wet foliage.",
        "hi": "मांकोजेब और मेटालाक्सिल जैसे फफूंदनाशक का उपयोग करें; संक्रमित पौधों को हटाएँ और पत्तियों को गीला रहने न दें।",
        "bn": "মানকোজেব ও মেটালাক্সিলের মতো ফাঙ্গিসাইড ব্যবহার করুন; আক্রান্ত গাছ সরান এবং ভেজা পাতা এড়ান।",
        "ta": "மாஉன்கோஜெபும் மெட்டாலாக்ஸிலும்ச் போன்ற பூஞ்சைநாசினிகளை பரிந்துரைபடி பயன்படுத்தவும்; பாதிக்கப்பட்ட செடிகளை அகற்று.",
        "te": "మాంకోజెబ్ మరియు మెటాలాక్సిల్ వంటి ఫంగిసైడ్లు వాడండి; సంక్రమిత మొక్కలను తీసివేయండి.",
        "pa": "ਮਾਂਕੋਜੇਬ ਅਤੇ ਮੇਟਾਲਾਕਸਿਲ ਵਰਗੇ ਫੰਗਿਸਾਇਡ ਵਰਤੋ; ਰੋਗੀ ਪੌਦਿਆਂ ਨੂੰ ਹਟਾਓ।"
      }
    },
    "boll rot in cotton": {
      "disease": "Boll Rot",
      "translations": {
        "hi": "कॉटन में बॉल रॉट",
        "bn": "কটনে বল রট",
        "ta": "காட்டனில் பால்ராட்",
        "te": "కాటన్ బోల్ రాట్",
        "pa": "ਕਾਪਾਸ ਵਿੱਚ ਬੋਲ ਰੋਟ"
      },
      "treatments": {
        "en": "Maintain field sanitation, avoid excess irrigation, and apply recommended fungicides where appropriate.",
        "hi": "क्षेत्र की सफाई बनाए रखें, अधिक सिंचाई से बचें और आवश्यकतानुसार फफूंदनाशक लगाएँ।",
        "bn": "ক্ষেত্র পরিষ্কার রাখুন, অতিরিক্ত সেচ এড়ান এবং প্রয়োজনীয় ফাঙ্গিসাইড প্রয়োগ করুন।",
        "ta": "களத்தை சுத்தமாக வைத்து, மிக அதிக நீர் தவிர்க்கவும் மற்றும் தேவையானால் பூஞ்சைநாசினி பயன்படுத்தவும்.",
        "te": "ఫీల్డ్ శుభ్రతను నిలిపిఉండు, ఎక్కువ నీరు ఇవ్వొద్దు, సూచించిన ఫంగిసైడ్ వాడండి.",
        "pa": "ਖੇਤਰ ਸਾਫ਼ ਰੱਖੋ, ਜਿਆਦਾ ਸਿੰਚਾਈ ਨਾ ਕਰੋ, ਜਰੂਰਤ ਹੋਵੇ ਤਾਂ ਫੰਗਿਸਾਇਡ ਲਗਾਓ।"
      }
    },
    "red rot in sugarcane": {
      "disease": "Red Rot (Sugarcane)",
      "translations": {
        "hi": "शुगरकेन में रेड रॉट",
        "bn": "গুড়চাষে রেড রট",
        "ta": "கரும்பில் செங்கல் சடனம்",
        "te": "షుగర్‌కేన్ రెడ్ రాట్",
        "pa": "ਚੀਨੀ ਬੂਟੇ ਵਿੱਚ ਲਾਲ ਰੋਟ"
      },
      "treatments": {
        "en": "Use resistant varieties, remove affected canes and practice sanitation; consult extension for fungicide seed treatment.",
        "hi": "प्रतिरोधी किस्में लगाएँ, संक्रमित कांड हटाएँ और सफाई रखें; बीज उपचार के लिए विशेषज्ञ से परामर्श लें।",
        "bn": "প্রতিরোধী জাত ব্যবহার করুন, সংক্রমিত কাণ্ড সরান এবং পরিচ্ছন্নতা বজায় রাখুন; বীজ চিকিত্সার জন্য পরামর্শ নিন।",
        "ta": "எதிர்ப்பான வகைகள் பயிரிடவும், பாதிக்கப்பட்ட ஒரு துண்டுகளை அகற்று மற்றும் சுத்தம் பேணவும்.",
        "te": "రెసిస్టెంట్ వేరైటీలు వాడు, సంక్రమిత రేడ్లను తీసివేయి, శుభ్రత పాటించు.",
        "pa": "ਰੋਧੀ ਕਿਸਮਾਂ ਵਰਤੋ, ਪ੍ਰਭਾਵਿਤ ਡੰਠਲ ਹਟਾਓ, ਸਫਾਈ ਰੱਖੋ।"
      }
    },
    "vine droop and yellowing": {
      "disease": "Phytopthora Root Rot (Vine crops)",
      "translations": {
        "hi": "लतें झुकना और पीलापन",
        "bn": "আঁটসাঁট হওয়া এবং হলুদ হওয়া",
        "ta": "சதையொடு மங்கல்",
        "te": "వైన్ ముక్కలు పసుపు",
        "pa": "ਬਣੇ ਵੇਜਾਂ 'ਚ ਪਿੱਲਾ"
      },
      "treatments": {
        "en": "Improve drainage, avoid waterlogging, drench seed/soil as per extension advice and remove infected plants.",
        "hi": "जल निकासी सुधारें, जलभरा से बचें, विशेषज्ञ सलाहानुसार मिट्टी/बीज उपचार करें और संक्रमित पौधे हटाएँ।",
        "bn": "নিষ্কাশন উন্নত করুন, জলাবদ্ধতা এড়ান, মাটির বা বীজের চিকিত্সা করুন এবং আক্রান্ত গাছ সরান।",
        "ta": "வடிகாலை மேம்படுத்து, நீர் நிறைவு தவிர்க்கவும், பரிந்துரைப்படி மண்/விதை சிகிச்சை செய்யவும்.",
        "te": "డ్రెయినేజ్ మెరుగుపరుచుకోండి, నీరు నిలవనివ్వకండి, సూచించిన మేరకు మట్టిని/విత్తనాన్ని చికిత్స చేయండి.",
        "pa": "ਨਿਕਾਸ ਸੁਧਾਰੋ, ਪਾਣੀ ਖੜਾ ਨਾ ਹੋਣ ਦਿਓ, ਜਰੂਰਤ ਮੁਤਾਬਕ ਧਰਤੀ ਜਾਂ ਬੀਜ ਦਾ ਇਲਾਜ ਕਰੋ।"
      }
    },
    "small pale spots on fruit": {
      "disease": "Anthracnose (Fruit/Vegetable)",
      "translations": {
        "hi": "फल पर छोटे फुसफुसे धब्बे",
        "bn": "ফল উপর ছোট দাগ",
        "ta": "பழத்தில் சிறிய ஆரங்கள்",
        "te": "పండ్లపై చిన్న మచ్చలు",
        "pa": "ਫਲਾਂ 'ਤੇ ਛੋਟੇ ਧੱਬੇ"
      },
      "treatments": {
        "en": "Sanitize orchards, remove infected fruit, apply recommended fungicide sprays at flowering/fruit set.",
        "hi": "बगीचों की सफाई करें, संक्रमित फल हटाएँ और फूलने/फल बनने पर अनुशंसित फफूंदनाशक छिड़कें।",
        "bn": "বাগান পরিষ্কার রাখুন, আক্রান্ত ফল সরান, ফুল দিন/ফল তৈরি সময় ফাঙ্গিসাইড স্প্রে করুন।",
        "ta": "இலைமரம் சுத்தம் படுத்தவும், பாதிக்கப்பட்ட பழங்களை அகற்று மற்றும் பரிந்துரைக்கபட்ட பூஞ்சைநாசினி தெளிக்கவும்.",
        "te": "మామిడి తోటలు శుభ్రంగా ఉంచండి, సంక్రమిత పండ్లను తీసేయండి, సూచించిన ఫంగిసైడ్ వాడండి.",
        "pa": "ਬਗ਼ੀਚਿਆਂ ਨੂੰ ਸਾਫ਼ ਰੱਖੋ, ਰੋਗੀ ਫਲ ਹਟਾਓ ਅਤੇ ਪਰਾਮਰਸ਼ਿਤ ਫੰਗਿਸਾਇਡ ਛਿੜਕੋ।"
      }
    },
    "legion of small holes on leaves": {
      "disease": "Insect Feeding / Chewing (Caterpillars/Beetles)",
      "translations": {
        "hi": "पतियों पर छोटे-छोटे छेद",
        "bn": "পাতায় ছোট ছোট ছিদ্র",
        "ta": "இலைகளில் சிறிய குழிகள்",
        "te": "ఆకులపై చిన్న రంధ్రాలు",
        "pa": "ਪੱਤਿਆਂ 'ਤੇ ਛੋਟੇ ਛੇਦ"
      },
      "treatments": {
        "en": "Identify pest (sticky traps/visual); use appropriate biopesticide or safe chemical as per extension guidelines.",
        "hi": "कीट की पहचान करें; उपयुक्त बायो-पेस्टिसाइड या सुरक्षित रासायनिक का प्रयोग करें (विस्तार सेवाओं के अनुसार)।",
        "bn": "পোকা শনাক্ত করুন; প্রয়োজনীয় বায়োপিস্টিসাইড বা নিরাপদ রাসায়নিক ব্যবহার করুন।",
        "ta": "கீடுகளை அடையாளம் காட்டு; தேவையான உயிரியல்/மருந்து முறைகளை பின்பற்றவும்.",
        "te": "పెస్టును గుర్తించండి, అవసరమైతే బయోపెస్టిసైడ్ లేదా సూచించిన రసాయన వాడండి.",
        "pa": "ਕੀਟ ਪਛਾਣੋ; ਜਰੂਰਤ ਮੁਤਾਬਕ ਬਾਇਓਪੈਸਟਿਸਾਈਡ ਜਾਂ ਸੁਰੱਖਿਅਤ ਰਸਾਇਣ ਵਰਤੋ।"
      }
    },
    "chlorotic veins on leaves": {
      "disease": "Iron Deficiency (Interveinal Chlorosis)",
      "translations": {
        "hi": "पतियों की नसों का पीला पड़ना",
        "bn": "পাতার রগগুলো হলুদ হয়ে যাওয়া",
        "ta": "இலைக் கோடுகளில் மஞ்சள் நிறம்",
        "te": "ఆకుల నాళాల్లో పసుపు రంధ్రము",
        "pa": "ਪੱਤਿਆਂ ਦੀਆਂ ਰੰਗਾਂ ਦਾ ਪੀਲਾ ਹੋਣਾ"
      },
      "treatments": {
        "en": "Apply iron chelates or foliar iron spray and correct soil pH if alkaline.",
        "hi": "आइरन कीलैट या पर्ण-स्प्रे प्रयोग करें और मिट्टी का pH जांचें।",
        "bn": "আয়রন কেলেট বা পাতায় আয়রন স্প্রে করুন এবং মাটির pH ঠিক করুন।",
        "ta": "இரும்பு சேர்க்கப்பட்ட உரம் அல்லது இலை தூய்வுப்பூச்சு செய்யவும், மண் pH சரிசெய்யவும்.",
        "te": "అయిరన్ చిలేట్స్ లేదా ఫోలియర్ ఆయిరన్ వాడండి; గుడ్డి pH పరీక్షించండి.",
        "pa": "ਆਇਰਨ ਚੀਲੇਟ ਜਾਂ ਫੋਲੀਅਰ ਆਇਰਨ ਛਿੜਕੋ ਅਤੇ ਮਿੱਟੀ ਦਾ pH ਚੈੱਕ ਕਰੋ।"
      }
    },
    "leaf yellowing with necrotic spots": {
      "disease": "Bacterial Leaf Spot",
      "translations": {
        "hi": "नाशिल धब्बों के साथ पीली पत्तियाँ",
        "bn": "নেক্রোটিক দাগসহ হলুদ আকা",
        "ta": "நாசி இடங்களுடன் மஞ்சள் இலைகள்",
        "te": "నెక్రోటిక్ మచ్చలతో పసుపు ఆకులు",
        "pa": "ਨੈਕਰੋਟਿਕ ਧੱਬਿਆਂ ਨਾਲ ਪੀਲੇ ਪੱਤੇ"
      },
      "treatments": {
        "en": "Use disease-free seed, improve field sanitation, copper-based sprays may help according to extension advice.",
        "hi": "रोग-मुक्त बीज का प्रयोग करें, खेत की सफाई रखें; तांबे-आधारित छिड़काव मदद कर सकता है।",
        "bn": "রোগমুক্ত বীজ ব্যবহার করুন, মাঠ পরিচ্ছন্ন রাখুন; কপার-বেসড স্প্রে সহায়ক হতে পারে।",
        "ta": "நோயின்றி விதைகள் பயன்படுத்து, கவனம் வைத்துக் கொள்ளவும்; கட்டுத்தர ஆலோசனையின் படி தாமிரம் அடிப்படையான தெளிக்கலாம்.",
        "te": "రోగ ముక్త విత్తనాలు వాడండి, పంట పరిరక్షణ చేయండి, అవసరమైతే కాపర్ స్ప్రే చేయండి.",
        "pa": "ਰੋਗਮੁਕਤ ਬੀਜ ਵਰਤੋ, ਖੇਤਰ ਸਾਫ਼ ਰੱਖੋ, ਕਾਪਰ-ਅਧਾਰਿਤ ਛਿੜਕਾਵ ਮਦਦਗਾਰ ਹੋ ਸਕਦੇ ਹਨ।"
      }
    }
  }
}